status/2022/0902.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-03 Sat 05:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>27 August 2022 - 02 September 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">27 August 2022 - 02 September 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c9f152">1. MIT OCW</a>
<ul>
<li><a href="#org29628a6">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org1ce1710">1.1.1. Session 84-85</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf2a5f51">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org03c850a">2.1. Need to finish desoldering switch</a></li>
</ul>
</li>
<li><a href="#org294842a">3. Mill Controller #2</a>
<ul>
<li><a href="#orga0091d3">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#orgd6f5174">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org45ff7b7">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orga9f11dd">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8af688e">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org8078715">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orgd09f9f9">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org07113af">5. OLPC</a>
<ul>
<li><a href="#org85eb5d6">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org2d952ef">6. Virtual Orchestra</a>
<ul>
<li><a href="#org0602b6a">6.1. sfz file tests</a>
<ul>
<li><a href="#orgc0917da">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org04a98fe">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#org003c0a2">7. gat</a>
<ul>
<li><a href="#org5f81028">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#orga01e739">8. abby</a>
<ul>
<li><a href="#orgdd02e7f">8.1. installed three wire chassis fan - too noisy</a></li>
<li><a href="#org4288d27">8.2. have another 3 wire fan from DET which may be less noisy</a></li>
<li><a href="#org3c6669e">8.3. need to get 4 wire chassis fan</a></li>
</ul>
</li>
<li><a href="#orge0ec7bd">9. marble computing</a>
<ul>
<li><a href="#orga448dc1">9.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#orgcc065f8">9.1.1. Logic table to operation 'compiler' done</a></li>
<li><a href="#orgdd29011">9.1.2. Nucleo-f303re controller IO done enough for servos</a></li>
<li><a href="#orgd8ae1a2">9.1.3. Waiting for servos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org896b0aa">10. samll graphics display</a>
<ul>
<li><a href="#orgfceeb2a">10.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#org6a5fda7">10.2. VT340+Regis graphics</a></li>
</ul>
</li>
<li><a href="#org1d55089">11. quilt table stands</a></li>
<li><a href="#org4b5d512">12. More project ideas</a>
<ul>
<li><a href="#orgdc6765b">12.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#orgbd6037b">12.2. GMPForth ports to SIMH</a>
<ul>
<li><a href="#org72d71f3">12.2.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#orgfc22a72">12.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org1339ddb">12.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org6d7b700">12.3. GMPASM assembler</a></li>
<li><a href="#orgc66403f">12.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#orgb669f4d">12.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#org8ebcc9a">12.5.1. Offline compilation</a></li>
<li><a href="#org2d3f9ec">12.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org3204b8b">12.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#orgddc732e">12.6.1. RTX2000, CDP1802 still in production!</a></li>
<li><a href="#org1f4f733">12.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orgd78f02f">12.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#orgcb1e376">12.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
</ul>
</li>
<li><a href="#org8ef93e4">12.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org0ba321f">12.7.1. OSI Superboard</a></li>
<li><a href="#orgc5edfce">12.7.2. Super Jolt</a></li>
<li><a href="#orge9c2315">12.7.3. Ampro Little Board</a></li>
<li><a href="#orga8e57fb">12.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgfa13901">12.7.5. Etc.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga696c42">13. David Davies</a>
<ul>
<li><a href="#orgdfa0e39">13.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgce63082">13.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org6de6a2c">13.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#orgaee3cd6">14. Peter Kim</a>
<ul>
<li><a href="#orgfa26eb9">14.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org8b4436b">14.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org14e8dfe">14.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#orgeb57087">14.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2c9f152" class="outline-2">
<h2 id="org2c9f152"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org29628a6" class="outline-3">
<h3 id="org29628a6"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1ce1710" class="outline-4">
<h4 id="org1ce1710"><span class="section-number-4">1.1.1.</span> Session 84-85</h4>
</div>
</div>
</div>
<div id="outline-container-orgf2a5f51" class="outline-2">
<h2 id="orgf2a5f51"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org03c850a" class="outline-3">
<h3 id="org03c850a"><span class="section-number-3">2.1.</span> Need to finish desoldering switch</h3>
</div>
</div>
<div id="outline-container-org294842a" class="outline-2">
<h2 id="org294842a"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga0091d3" class="outline-3">
<h3 id="orga0091d3"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-orgd6f5174" class="outline-3">
<h3 id="orgd6f5174"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org45ff7b7" class="outline-4">
<h4 id="org45ff7b7"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orga9f11dd" class="outline-4">
<h4 id="orga9f11dd"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8af688e" class="outline-2">
<h2 id="org8af688e"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8078715" class="outline-3">
<h3 id="org8078715"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orgd09f9f9" class="outline-3">
<h3 id="orgd09f9f9"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org07113af" class="outline-2">
<h2 id="org07113af"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org85eb5d6" class="outline-3">
<h3 id="org85eb5d6"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org2d952ef" class="outline-2">
<h2 id="org2d952ef"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0602b6a" class="outline-3">
<h3 id="org0602b6a"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgc0917da" class="outline-4">
<h4 id="orgc0917da"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org04a98fe" class="outline-3">
<h3 id="org04a98fe"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-org003c0a2" class="outline-2">
<h2 id="org003c0a2"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org5f81028" class="outline-3">
<h3 id="org5f81028"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-orga01e739" class="outline-2">
<h2 id="orga01e739"><span class="section-number-2">8.</span> abby</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdd02e7f" class="outline-3">
<h3 id="orgdd02e7f"><span class="section-number-3">8.1.</span> installed three wire chassis fan - too noisy</h3>
</div>
<div id="outline-container-org4288d27" class="outline-3">
<h3 id="org4288d27"><span class="section-number-3">8.2.</span> have another 3 wire fan from DET which may be less noisy</h3>
</div>
<div id="outline-container-org3c6669e" class="outline-3">
<h3 id="org3c6669e"><span class="section-number-3">8.3.</span> need to get 4 wire chassis fan</h3>
</div>
</div>
<div id="outline-container-orge0ec7bd" class="outline-2">
<h2 id="orge0ec7bd"><span class="section-number-2">9.</span> marble computing</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orga448dc1" class="outline-3">
<h3 id="orga448dc1"><span class="section-number-3">9.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgcc065f8" class="outline-4">
<h4 id="orgcc065f8"><span class="section-number-4">9.1.1.</span> Logic table to operation 'compiler' done</h4>
</div>
<div id="outline-container-orgdd29011" class="outline-4">
<h4 id="orgdd29011"><span class="section-number-4">9.1.2.</span> Nucleo-f303re controller IO done enough for servos</h4>
</div>
<div id="outline-container-orgd8ae1a2" class="outline-4">
<h4 id="orgd8ae1a2"><span class="section-number-4">9.1.3.</span> Waiting for servos</h4>
</div>
</div>
</div>
<div id="outline-container-org896b0aa" class="outline-2">
<h2 id="org896b0aa"><span class="section-number-2">10.</span> samll graphics display</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgfceeb2a" class="outline-3">
<h3 id="orgfceeb2a"><span class="section-number-3">10.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
</div>
<div id="outline-container-org6a5fda7" class="outline-3">
<h3 id="org6a5fda7"><span class="section-number-3">10.2.</span> VT340+Regis graphics</h3>
</div>
</div>
<div id="outline-container-org1d55089" class="outline-2">
<h2 id="org1d55089"><span class="section-number-2">11.</span> quilt table stands</h2>
<div class="outline-text-2" id="text-11">
<p>
Small stands for quilt table to support opened table over quilt frame.
Good thing they were simple because in the end turned out to be
unnecessary - the quilt frame can be adjusted to support.
</p>
</div>
</div>
<div id="outline-container-org4b5d512" class="outline-2">
<h2 id="org4b5d512"><span class="section-number-2">12.</span> More project ideas</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgdc6765b" class="outline-3">
<h3 id="orgdc6765b"><span class="section-number-3">12.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-orgbd6037b" class="outline-3">
<h3 id="orgbd6037b"><span class="section-number-3">12.2.</span> GMPForth ports to SIMH</h3>
<div class="outline-text-3" id="text-12-2">
</div>
<div id="outline-container-org72d71f3" class="outline-4">
<h4 id="org72d71f3"><span class="section-number-4">12.2.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-orgfc22a72" class="outline-4">
<h4 id="orgfc22a72"><span class="section-number-4">12.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-12-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org1339ddb" class="outline-4">
<h4 id="org1339ddb"><span class="section-number-4">12.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org6d7b700" class="outline-3">
<h3 id="org6d7b700"><span class="section-number-3">12.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-12-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orgc66403f" class="outline-3">
<h3 id="orgc66403f"><span class="section-number-3">12.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-orgb669f4d" class="outline-3">
<h3 id="orgb669f4d"><span class="section-number-3">12.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-12-5">
</div>
<div id="outline-container-org8ebcc9a" class="outline-4">
<h4 id="org8ebcc9a"><span class="section-number-4">12.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org2d3f9ec" class="outline-4">
<h4 id="org2d3f9ec"><span class="section-number-4">12.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org3204b8b" class="outline-3">
<h3 id="org3204b8b"><span class="section-number-3">12.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-12-6">
</div>
<div id="outline-container-orgddc732e" class="outline-4">
<h4 id="orgddc732e"><span class="section-number-4">12.6.1.</span> RTX2000, CDP1802 still in production!</h4>
</div>
<div id="outline-container-org1f4f733" class="outline-4">
<h4 id="org1f4f733"><span class="section-number-4">12.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orgd78f02f" class="outline-4">
<h4 id="orgd78f02f"><span class="section-number-4">12.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgcb1e376" class="outline-4">
<h4 id="orgcb1e376"><span class="section-number-4">12.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
</div>
<div id="outline-container-org8ef93e4" class="outline-3">
<h3 id="org8ef93e4"><span class="section-number-3">12.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-12-7">
</div>
<div id="outline-container-org0ba321f" class="outline-4">
<h4 id="org0ba321f"><span class="section-number-4">12.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-12-7-1">
<p>
Unknown
</p>
</div>
</div>
<div id="outline-container-orgc5edfce" class="outline-4">
<h4 id="orgc5edfce"><span class="section-number-4">12.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-12-7-2">
<p>
Unknown
</p>
</div>
</div>
<div id="outline-container-orge9c2315" class="outline-4">
<h4 id="orge9c2315"><span class="section-number-4">12.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-12-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orga8e57fb" class="outline-4">
<h4 id="orga8e57fb"><span class="section-number-4">12.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-12-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-orgfa13901" class="outline-4">
<h4 id="orgfa13901"><span class="section-number-4">12.7.5.</span> Etc.</h4>
</div>
</div>
</div>
<div id="outline-container-orga696c42" class="outline-2">
<h2 id="orga696c42"><span class="section-number-2">13.</span> David Davies</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgdfa0e39" class="outline-3">
<h3 id="orgdfa0e39"><span class="section-number-3">13.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgce63082" class="outline-3">
<h3 id="orgce63082"><span class="section-number-3">13.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org6de6a2c" class="outline-3">
<h3 id="org6de6a2c"><span class="section-number-3">13.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-orgaee3cd6" class="outline-2">
<h2 id="orgaee3cd6"><span class="section-number-2">14.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgfa26eb9" class="outline-3">
<h3 id="orgfa26eb9"><span class="section-number-3">14.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org8b4436b" class="outline-3">
<h3 id="org8b4436b"><span class="section-number-3">14.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org14e8dfe" class="outline-3">
<h3 id="org14e8dfe"><span class="section-number-3">14.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-orgeb57087" class="outline-3">
<h3 id="orgeb57087"><span class="section-number-3">14.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-09-03 Sat 05:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
